hw1-4/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 2 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Alien' LIMIT 1
---
  def similar
    mov = Movie.find_by_id(params[:id])
    if mov.director.nil? or mov.director == ''
      @movies = []
      flash[:notice] = "'#{mov.title}' has no director info"
      flash.keep
      redirect_to movies_path
    else
      @movies = Movie.find(:all, :conditions=>{:director=>mov.director})